Revit 2024 API
WorksharingDisplaySettings.GetGraphicOverrides Method (CheckoutStatus)
 Returns the graphic overrides associated with a particular ownership status.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public WorksharingDisplayGraphicSettings GetGraphicOverrides(
	CheckoutStatus ownershipStatus
)
Visual Basic
Public Function GetGraphicOverrides ( _
	ownershipStatus As CheckoutStatus _
) As WorksharingDisplayGraphicSettings
Visual C++
public:
WorksharingDisplayGraphicSettings^ GetGraphicOverrides(
	CheckoutStatus ownershipStatus
)
Parameters
ownershipStatus
Type: Autodesk.Revit.DB.CheckoutStatus
 The ownership status of interest.
Return Value
 Returns the graphic overrides assigned to a particular ownership status.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
WorksharingDisplaySettings Class
GetGraphicOverrides Overload
Autodesk.Revit.DB Namespace